about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-30 Tue 22:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About Me</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</a></li>
            <li class="dark-mode-nav-item"><a href="#" class="dark-mode-toggle-nav" onclick="toggleDarkMode(); return false;">🌙</a></li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">About Me</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#aboutcontact">About/Contact</a>
<ul>
<li><a href="#org16a9552">Self</a></li>
<li><a href="#content">Content</a></li>
<li><a href="#disagreeing-with-me">Disagreeing with Me</a></li>
<li><a href="#getting-in-touch-with-me">Getting in Touch with Me</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-aboutcontact" class="outline-1">
<h1 id="aboutcontact">About/Contact</h1>
<div class="outline-text-1" id="text-aboutcontact">
<p>
Hello!
</p>
</div>

<div id="outline-container-org16a9552" class="outline-2">
<h2 id="org16a9552">Self</h2>
<div class="outline-text-2" id="text-org16a9552">
<p>
I'm Eryk. I am a research scientist at <a href="https://en.wikipedia.org/wiki/Riot_Games">Riot Games</a>. I did my
undergraduate degree in Cognitive Science at Yale University (Class of
2017), and did my masters degree in Artificial Intelligence at Johns
Hopkins University (Class of 2024). My work touches a lot of topics in
deep learning, specifically in spots where it could potentially add
value to <a href="https://planetbanatt.net/articles/usefulgames.html">games</a>. I am often referred to online as "Ambisinister" or
sometimes just "Ambi"<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>
</div>
</div>

<div id="outline-container-content" class="outline-2">
<h2 id="content">Content</h2>
<div class="outline-text-2" id="text-content">
<p>
I use this website as a way to help me think about things. Scattered
across this website are writings on various topics like machine
learning, cognitive science, programming, video games, multimedia,
energy drinks, anime, and all sorts of other things. This website is a
big digital notebook that I use so I have easy access from any device
to thoughts I have had before, even in cases where they are
<a href="https://planetbanatt.net/articles/energydrink.html">potentially</a> <a href="https://planetbanatt.net/articles/huel.html">silly</a>. <i>Writing is thinking</i>, so a useful framework for
understanding this website is that it contains my thinking, and is
therefore always subject to change.
</p>

<p>
As a result, I keep no chronology of the posts I put on here, roughly
by design &#x2013; I have an explicit dislike for blogs, since I want both
the reader and myself to revisit any page on here in 5/10/20
years. What works best for me is if I keep all of these thoughts in a
large collection of plaintext files on my computer, and automatically
generate the website from these files<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>

<p>
If you want to understand <i>what I am up to</i>, I do try to maintain a
relatively light log of my inputs/outputs over on the <a href="https://planetbanatt.net/links.html">links page</a>, but
since this is performed by hand there's no guarantee it will be
comprehensive, it mostly serves as a way for me to save things I want
to remember + keep myself accountable doing things.
</p>
</div>
</div>

<div id="outline-container-disagreeing-with-me" class="outline-2">
<h2 id="disagreeing-with-me">Disagreeing with Me</h2>
<div class="outline-text-2" id="text-disagreeing-with-me">
<p>
You may eventually find a point on which you disagree with me on,
perhaps extremely strongly. For these events, please consult the
following directions:
</p>

<p>
For smaller disagreements, I would suggest just confronting me about
them. I have a stronger interest in holding accurate beliefs than
defending my own beliefs, so there's a very real chance that you'll be
able to change my mind, and even if you're certain I won't be able to
change yours I would probably appreciate the opportunity to challenge my
own beliefs and make them more accurate. You can do this at virtually
any time, and I will not request time to prepare myself since if I need
preparation then I probably don't have a very solid grasp of why I
believe the thing anyways.
</p>

<p>
For larger disagreements, we can settle it like gentlemen/women and have
a good, honest duel over it. I propose a set of three games, each best
of three. one in a game of my own choosing (most likely Super Smash
Brothers Melee), one game of your choosing, and a game in the middle
(let's say, rock paper scissors). For these disagreements, I suggest a
training period of one month in which I can learn your game and you can
learn mine, and at the end of the month we duel and the winner would be
declared the victor, being definitively and objectively correct at
whatever squabble we were having. I am reasonably competent at many
games, but I am not amazing at any of them, so I find this to be a fair
victory condition.
</p>

<p>
For the biggest, most impossible to resolve disagreements, I am willing
to accept a challenge to a fair and honorable boxing match to the death.
Please only use this option for the most passionate beliefs you have,
those because of which my existence completely invalidates yours. I
reserve the right to tap out at any time (with the condition that you
are declared right, of course). However, this will require a full year
of training, in which I will have enough time to get in decent shape,
learn some sort of martial arts, and come to terms with the fragility of
life. Like I mentioned, though, most things probably would be better
suited for the previous condition with the three video games, so please
choose those as a default option.
</p>
</div>
</div>

<div id="outline-container-getting-in-touch-with-me" class="outline-2">
<h2 id="getting-in-touch-with-me">Getting in Touch with Me</h2>
<div class="outline-text-2" id="text-getting-in-touch-with-me">
<p>
If you want to talk to me about academics or any of my more serious
projects, feel free to shoot me an email at erykbanatt@gmail.com
</p>

<p>
You can find me on twitter. I maintain two accounts as to not flood people's timelines with crossed interests. Gaming: <a href="https://www.twitter.com/ambisinister_">@ambisinister_</a> AI/ML: <a href="https://x.com/erykbanatt">@erykbanatt</a>.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Specifically, this is <a href="https://liquipedia.net/smash/Ambisinister">my gamertag</a> (adj. Clumsy or Unskilled with both hands), but you can just think of it as a common nickname I am often called. 
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
If you've poked around the source for these pages and been mortified, please understand that this is why the pages are like that. This is all hacked together from the org export function in my emacs configuration, and it's a miracle any of it works at all &#x2013; this website is not meant to be a showcase of my ability to do webdev, it's meant to be a maximally frictionless way for me to type plaintext into emacs and post that somewhere.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
